#  Creating Views (Part 1)

###  Learning Objectives
By the end of this lesson, you should be able to:
- Create **LOOKUP**, **JOIN**, and **AGGREGATING** views.  
- **Drop** views when they’re no longer needed.



###  Database Connection
We’ll use the **Chinook** database — a classic sample database representing a digital media store.  
Ensure `chinook.db` is located in the same folder as this notebook.

In [1]:
%load_ext sql

In [2]:
%sql sqlite:///chinook.sqlite

##  Exercise 1 — Create a LOOKUP View
Let’s create a simple **LOOKUP view** that displays the surname, first name, title, and country of each employee.  
We’ll name this view **Employee_View**.

In [3]:
%%sql

CREATE VIEW Employee_View AS
SELECT
    LastName AS Surname,
    FirstName,
    Title,
    Country
FROM
    Employee;

 * sqlite:///chinook.sqlite
Done.

[]

##  Exercise 2 — Query the LOOKUP View
Now we’ll query the `Employee_View` to filter and view members of the **Sales** team.  
We’ll use the `LIKE` operator with a wildcard to find employees whose job title contains the word *Sales*.

In [4]:
%%sql

SELECT *
FROM Employee_View
WHERE Title LIKE '%Sales%';

 * sqlite:///chinook.sqlite
Done.

[('Edwards', 'Nancy', 'Sales Manager', 'Canada'),
 ('Peacock', 'Jane', 'Sales Support Agent', 'Canada'),
 ('Park', 'Margaret', 'Sales Support Agent', 'Canada'),
 ('Johnson', 'Steve', 'Sales Support Agent', 'Canada')]

##  Exercise 3 — Create a JOIN View
Next, we’ll create a **JOIN view** that links each customer with the support staff assisting them.  
We’ll name this view **Customer_Support_View** and include the following columns:

- Customer first and last name  
- Customer country  
- SupportRepId  
- EmployeeId  
- Employee’s first and last name  
- Job title  
- Employee country

In [5]:
%%sql

CREATE VIEW Customer_Support_View AS
SELECT
    c.FirstName AS Customer_FirstName,
    c.LastName AS Customer_LastName,
    c.Country AS Customer_Country,
    c.SupportRepId,
    e.EmployeeId,
    e.LastName AS Employee_LastName,
    e.FirstName AS Employee_FirstName,
    e.Title AS Employee_Title,
    e.Country AS Employee_Country
FROM
    Customer AS c
JOIN
    Employee AS e
ON
    c.SupportRepId = e.EmployeeId;

 * sqlite:///chinook.sqlite
Done.

[]

##  Exercise 4 — Query the JOIN View
Let’s query the `Customer_Support_View` to get a list of clients who were helped by the employee with `EmployeeId = 3`.  
We’ll display only the customer’s first and last names.

In [6]:
%%sql

SELECT
    Customer_FirstName,
    Customer_LastName
FROM
    Customer_Support_View
WHERE
    EmployeeId = 3;

 * sqlite:///chinook.sqlite
Done.

[('Luís', 'Gonçalves'),
 ('François', 'Tremblay'),
 ('Roberto', 'Almeida'),
 ('Jennifer', 'Peterson'),
 ('Michelle', 'Brooks'),
 ('Tim', 'Goyer'),
 ('Frank', 'Ralston'),
 ('Robert', 'Brown'),
 ('Edward', 'Francis'),
 ('Ellie', 'Sullivan'),
 ('Fynn', 'Zimmermann'),
 ('Niklas', 'Schröder'),
 ('Wyatt', 'Girard'),
 ('Isabelle', 'Mercier'),
 ('Terhi', 'Hämäläinen'),
 ('Ladislav', 'Kovács'),
 ('Hugh', "O'Reilly"),
 ('Emma', 'Jones'),
 ('Phil', 'Hughes'),
 ('Manoj', 'Pareek'),
 ('Puja', 'Srivastava')]

##  Exercise 5 — Create an AGGREGATING View
Now, we’ll create a **summary (aggregating)** view called **Customer_per_Country_View**,  
which counts how many customers are being serviced in each country.

In [7]:
%%sql

CREATE VIEW Customer_per_Country_View AS
SELECT
    Country,
    COUNT(CustomerId) AS Number_of_Customers
FROM
    Customer
GROUP BY
    Country;

 * sqlite:///chinook.sqlite
Done.

[]

##  Exercise 6 — Query the Country with the Most Customers
Using our `Customer_per_Country_View`, we’ll identify the country that has the highest number of customers.

In [8]:
%%sql

SELECT
    Country,
    Number_of_Customers
FROM
    Customer_per_Country_View
ORDER BY
    Number_of_Customers DESC
LIMIT 1;

 * sqlite:///chinook.sqlite
Done.

[('USA', 13)]

##  Exercise 7 — Drop a View
If we no longer need the `Employee_View`, we can safely **delete** it from our database using the `DROP VIEW` command.

In [9]:
%%sql
DROP VIEW IF EXISTS Employee_View;

 * sqlite:///chinook.sqlite
Done.

[]

##  Challenge — Support_Person_Stats View
As a final challenge, let’s create a view that shows the number of customers each support employee assists.  
We’ll name this view **Support_Person_Stats** and display:
- Employee first and last name  
- Number of customers they support

In [10]:
%%sql

CREATE VIEW Support_Person_Stats AS
SELECT
    e.FirstName AS Employee_FirstName,
    e.LastName AS Employee_LastName,
    COUNT(c.CustomerId) AS Number_of_Customers_Serviced
FROM
    Employee AS e
LEFT JOIN
    Customer AS c
ON
    e.EmployeeId = c.SupportRepId
GROUP BY
    e.EmployeeId, e.FirstName, e.LastName;

 * sqlite:///chinook.sqlite
Done.

[]

##  Summary
In this notebook, we explored how to:
- Create **lookup**, **join**, and **aggregating** views to simplify data access and analysis.  
- Use **wildcards** (`LIKE`) for flexible filtering in views.  
- **Drop** views safely when they’re no longer needed.  
- Combine **joins** and **aggregations** to build insightful, reusable database views.

Views make your SQL workflows cleaner, more modular, and easier to maintain.